// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

// 5 -> 2, 4
// 8 -> 2, 4, 6, 8

Console.WriteLine("Введите число: ");
long n = Convert.ToInt64(Console.ReadLine());
long a = 1;
while (a = n);
if(a % 2 == 1)
{
    Console.WriteLine("Четные числа" + n );
}
a++;